import  re

# 1.
s1 = "345 6265654 689686 20"
print(re.findall(r"\w+\s\w+",s1))  # ['345 6265654', '689686 20']

s1 = "345 6265654 689686 20"
print(re.findall(r"(\w+)\s\w+",s1))  # ['345', '689686']
"""
实际匹配到的内容是345 6265654和689686 20
但是，findall默认情况下只输出（）中匹配到的内容，所以结果为['345', '689686']
"""

s1 = "345 6265654 689686 20"
print(re.findall(r"(?:\w+)\s\w+",s1))  # ['345 6265654', '689686 20']

"""
(正则)  捕获组，
(?:正则)  非捕获组

结论：如果findall的正则表达式中出现了(),默认只会输出()中的内容
但是如果使用(?:),则会输出所有匹配到的内容
"""

# 练习：提取下面字符串中的有效邮箱
mail = "123@qq.comfafaa@163.comhello@sina.comfahf673@fhajg"
# .在正则表达式中本来有特殊含义，如果需要当做普通字符使用，则需要使用\转义
print(re.findall(r"\w+@(qq|163|sina|126)\.com",mail))
print(re.findall(r"\w+@(?:qq|163|sina|126)\.com",mail))
"""
['qq', '163', 'sina']
['123@qq.com', 'fafaa@163.com', 'hello@sina.com']
"""
